[
    {
        "title": "Elon Musk’s robotaxi fantasy is starting to unravel",
        "url": "https://www.theverge.com/tesla/654253/tesla-robotaxi-elon-musk-earnings-promise-fantasy",
        "markdown_title": "[Elon Musk’s robotaxi fantasy is starting to unravel](https://www.theverge.com/tesla/654253/tesla-robotaxi-elon-musk-earnings-promise-fantasy)",
        "publish_date": "23 Apr 2025",
        "source": "The Verge",
        "sentiment": 0,
        "summary": "Elon Musk has been promising to have fully autonomous Tesla vehicles on the road by the end of next year for several years. Musk has faced criticism for his overly optimistic outlook on self-driving technology and for not addressing the limitations of his own company's technology. Musk is intent on continuing to pursue the goal of deploying fully autonomous vehicles using a camera-only sensor suite and an end-to-end neural network, but he faces questions about the company's current progress and future plans. The text suggests that while Musk may be willing to continue pursuing his vision of a future-focused company producing millions of robots, it may be difficult to achieve given the current challenges facing the industry and the political landscape."
    },
    {
        "title": "Tesla’s revenue and profits tank amid political chaos",
        "url": "https://www.theverge.com/news/653645/tesla-q1-earnings-2025-revenue-profit-elon-musk",
        "markdown_title": "[Tesla’s revenue and profits tank amid political chaos](https://www.theverge.com/news/653645/tesla-q1-earnings-2025-revenue-profit-elon-musk)",
        "publish_date": "22 Apr 2025",
        "source": "The Verge",
        "sentiment": -0.204,
        "summary": "Tesla reported a decline in revenue and profits for the first quarter, with $409 million in net income on $19.3 billion in revenue. The company's net income dropped by 71% to $409 million on $19.3 billion in revenue. Tesla acknowledged that tariffs and \"changing political sentiment\" will continue to complicate efforts to grow out of its current rut. The company is rethinking its 2025 guidance and will update it after next quarter."
    },
    {
        "title": "Tesla Supercharger damaged in possible explosion in Washington",
        "url": "https://www.theverge.com/news/645378/tesla-supercharger-damaged-explosion-washington",
        "markdown_title": "[Tesla Supercharger damaged in possible explosion in Washington](https://www.theverge.com/news/645378/tesla-supercharger-damaged-explosion-washington)",
        "publish_date": "08 Apr 2025",
        "source": "The Verge",
        "sentiment": -0.433,
        "summary": "A Tesla Supercharger station was severely damaged in a possible explosion in Lacey, Washington. The local police department and the FBI are investigating the incident. The company is \"on site\" with law enforcement and reviewing camera footage. It's the latest incident of Tesla-related vandalism following CEO Elon Musk's high-profile position in the Trump administration as the head of the Department of Government Efficiency."
    },
    {
        "title": "Tesla’s latest Cybertruck has longer range and the cheapest price yet",
        "url": "https://www.theverge.com/news/647060/tesla-cybertruck-rwd-long-lange-model-launch-entry",
        "markdown_title": "[Tesla’s latest Cybertruck has longer range and the cheapest price yet](https://www.theverge.com/news/647060/tesla-cybertruck-rwd-long-lange-model-launch-entry)",
        "publish_date": "11 Apr 2025",
        "source": "The Verge",
        "sentiment": 0,
        "summary": "Tesla has released a new Cybertruck model with longer range and the cheapest price yet at $69,990 before the federal $7,500 credit. The entry-level Cybertruck has just one RWD motor instead of two in the AWD model. It also lacks a powered roll-up hard tonneau cover and a $750 fitted soft tonneau cover. The new Cybertruck can drive up to 350 miles on a charge and tow 7,500 pounds compared to 11,000 lbs on the other trims."
    },
    {
        "title": "Tesla is making progress on its 1950s diner and drive-in",
        "url": "https://www.theverge.com/news/653959/tesla-1950s-diner-drive-in-near-complete-los-angeles",
        "markdown_title": "[Tesla is making progress on its 1950s diner and drive-in](https://www.theverge.com/news/653959/tesla-1950s-diner-drive-in-near-complete-los-angeles)",
        "publish_date": "22 Apr 2025",
        "source": "The Verge",
        "sentiment": 0.494,
        "summary": "Tesla has shared new images of its first retro drive-in location in Los Angeles. The company's CEO Elon Musk dreamt up the idea of a 1950s-themed \"Tesla Diner\" and Supercharger hub as far back as 2018. Last week, The Real Deal reported that Tesla is nearing completion with the diner located on Santa Monica Boulevard. Tesla got the permit for the diner seven years ago."
    },
    {
        "title": "Elon Sounds Extremely Depressed After Tesla Profits Plunge 71%",
        "url": "https://gizmodo.com/elon-sounds-extremely-depressed-after-tesla-profits-plunge-71-2000593013",
        "markdown_title": "[Elon Sounds Extremely Depressed After Tesla Profits Plunge 71%](https://gizmodo.com/elon-sounds-extremely-depressed-after-tesla-profits-plunge-71-2000593013)",
        "publish_date": "22 Apr 2025",
        "source": "Gizmodo.com",
        "sentiment": -0.516,
        "summary": "Tesla reported lower than expected earnings on Tuesday, with first-quarter profits dropping 71% on much lower sales of electric vehicles. Elon Musk tried to put a slightly rosier spin on the state of his EV company in an earnings call Tuesday, but still sounded very depressed. The company produced $19.3 billion in revenue in the first quarter, down 9% compared with the same period a year earlier. Deliveries of Tesla's Model 3 and Model Y were down 12%."
    },
    {
        "title": "Tesla won’t have to report as many Level 2 crashes after Trump’s rule change",
        "url": "https://www.theverge.com/news/657859/tesla-adas-crash-report-nhtsa-sgo-trump-musk",
        "markdown_title": "[Tesla won’t have to report as many Level 2 crashes after Trump’s rule change](https://www.theverge.com/news/657859/tesla-adas-crash-report-nhtsa-sgo-trump-musk)",
        "publish_date": "29 Apr 2025",
        "source": "The Verge",
        "sentiment": 0,
        "summary": "The US Department of Transportation announced a major change to the Biden-era rule that requires automakers and tech companies to report crashes that involve fully or partially autonomous vehicles. Under the revised rules, companies will no longer have to report certain crashes, such as those involving a vehicle equipped with a Level 2 advanced driver assist system (ADAS) that resulted in a tow-away, but no injuries, fatalities, or airbag deployments. Tesla represented the bulk of crashes reported to the National Highway Traffic Safety Administration (NHTSA) involving vehicles with Level 2 automated systems. According to NHTSA, a total of 2,359 crashes involving vehicles equipped with ADAS were reported since the rule was first implemented in July 2021."
    },
    {
        "title": "Tesla’s Cybertruck is getting deeper discounts and production cuts",
        "url": "https://www.theverge.com/news/652164/tesla-cybertruck-discounts-production-cuts-2024-foundation-series",
        "markdown_title": "[Tesla’s Cybertruck is getting deeper discounts and production cuts](https://www.theverge.com/news/652164/tesla-cybertruck-discounts-production-cuts-2024-foundation-series)",
        "publish_date": "18 Apr 2025",
        "source": "The Verge",
        "sentiment": -0.191,
        "summary": "Tesla's Cybertruck is getting deeper discounts and production cuts. Many Cybertrucks listed on Tesla's website are from 2024 model year with discounts of $10,000 or more. Some Cybertruck models won't be eligible for $7,500 federal tax credit due to their age or sticker price. Used Cybertruck prices are also taking a hit with an average used Cybertruck selling for $85,000 on CarGurus today and $104,300 and $107,800 respectively in December and November respectively."
    },
    {
        "title": "Elon Musk says he’ll step back from DOGE starting in May",
        "url": "https://www.theverge.com/news/653928/elon-musk-doge-step-back-tesla-earnings",
        "markdown_title": "[Elon Musk says he’ll step back from DOGE starting in May](https://www.theverge.com/news/653928/elon-musk-doge-step-back-tesla-earnings)",
        "publish_date": "22 Apr 2025",
        "source": "The Verge",
        "sentiment": 0,
        "summary": "Elon Musk announced that he will step back from his work at the Department of Government Efficiency (DOGE) starting in May. He said that he would continue to \"spend a day or two\" each week on DOGE matters \"probably for the remainder of the president's term,\" but would spend the bulk of his time focused on his electric car company. As a special advisor to the Trump administration, Musk was limited to just 130 days under the designation. Musk has been urged by Tesla investors to step down from the controversial project and focus more attention on Tesla, which is undergoing a major sales slump."
    },
    {
        "title": "Now Kia EVs can use Tesla’s Superchargers",
        "url": "https://www.theverge.com/news/655855/kia-tesla-supercharger-access-nacs-ev6-ev9-niro",
        "markdown_title": "[Now Kia EVs can use Tesla’s Superchargers](https://www.theverge.com/news/655855/kia-tesla-supercharger-access-nacs-ev6-ev9-niro)",
        "publish_date": "24 Apr 2025",
        "source": "The Verge",
        "sentiment": 0.439,
        "summary": "Kia is the latest automaker to be granted Tesla Supercharger access. The news comes as Kia announces a refreshed Kia EV6 model for 2025 this week, which will come standard with a Tesla-style NACS port. Owners of current EV6, EV9, and Niro EV models can use a CCS1-to-NACS adapter, which can be purchased from Kia dealers. Some Kia EV6 and EV9 owners have previously tricked Superchargers into charging their EVs by telling the Tesla app that they are driving a Hyundai Ioniq 5."
    },
    {
        "title": "Tesla whistleblower wins legal battle against Elon Musk",
        "url": "https://www.bbc.com/news/articles/cevdz4yxpd9o",
        "markdown_title": "[Tesla whistleblower wins legal battle against Elon Musk](https://www.bbc.com/news/articles/cevdz4yxpd9o)",
        "publish_date": "17 Apr 2025",
        "source": "BBC News",
        "sentiment": -0.574,
        "summary": "A whistleblower named Cristina Balan has won a legal battle against Tesla and its CEO, Elon Musk. Ms. Balan raised safety concerns about the design flaw in Tesla cars in 2014. She was fired for her concerns and later won a wrongful dismissal case. The case went to arbitration but was dismissed due to California's statute of limitations."
    },
    {
        "title": "As Elon Musk Torches Reputation, Tesla Sees Its Biggest Sales Decline In History",
        "url": "https://gizmodo.com/as-elon-musk-torches-reputation-tesla-sees-its-biggest-sales-decline-in-history-2000584080",
        "markdown_title": "[As Elon Musk Torches Reputation, Tesla Sees Its Biggest Sales Decline In History](https://gizmodo.com/as-elon-musk-torches-reputation-tesla-sees-its-biggest-sales-decline-in-history-2000584080)",
        "publish_date": "02 Apr 2025",
        "source": "Gizmodo.com",
        "sentiment": -0.502,
        "summary": "Tesla reported its steepest sales decline in company history for the first three months of 2025. The decline was expected due to Europe's poor performance and Tesla's temporary closure of factories to update production lines for the new Model Y. Some buyers held off while waiting for the updated version of the most popular car to become available. On Tuesday, Electrek reported that Tesla currently has $200 million worth of Cybertrucks sitting unsold in its inventory."
    },
    {
        "title": "How Biden Set Up Trump to Use Authoritarian Tactics on Tesla Protesters",
        "url": "https://gizmodo.com/how-biden-set-trump-up-to-use-authoritarian-tactics-on-tesla-protesters-2000588237",
        "markdown_title": "[How Biden Set Up Trump to Use Authoritarian Tactics on Tesla Protesters](https://gizmodo.com/how-biden-set-trump-up-to-use-authoritarian-tactics-on-tesla-protesters-2000588237)",
        "publish_date": "12 Apr 2025",
        "source": "Gizmodo.com",
        "sentiment": 0,
        "summary": "The Biden administration established a new domestic terror program in 2021 that was opposed by human rights groups. Now, the Trump administration appears to be using the legal and operational infrastructure set up during the Biden years to go after leftwing protesters. According to government insiders, the Justice Department has pivoted federal law enforcement away from more traditional enemies and towards people who vandalize Tesla dealerships. The full scale of the program is not publicly known and there are concerns about a secret program that spies on Americans and treats them like terrorists."
    },
    {
        "title": "Tesla Halts Sales of Model S and X in China as Tariffs Take a Toll",
        "url": "https://gizmodo.com/tesla-halts-sales-of-model-s-and-x-in-china-as-tariffs-take-a-toll-2000588193",
        "markdown_title": "[Tesla Halts Sales of Model S and X in China as Tariffs Take a Toll](https://gizmodo.com/tesla-halts-sales-of-model-s-and-x-in-china-as-tariffs-take-a-toll-2000588193)",
        "publish_date": "11 Apr 2025",
        "source": "Gizmodo.com",
        "sentiment": 0,
        "summary": "Tesla has stopped taking orders for its high-end Model S and Model X vehicles in China because the company imports those into the market. The more affordable Model 3 and Model Y vehicles are not impacted by that country's 125% tariffs implemented in the ongoing trade war. Being so close to President Trump has been something of a double-edged sword for CEO Elon Musk. While he appears to be lining up lucrative contracts for his empire of businesses, Musk's global reach makes him highly exposed to geopolitical feuds and an easy target in scuffles with adversaries."
    },
    {
        "title": "Elon Musk’s DOGE Seems to Be Losing Steam as He Prepares to Retreat to Tesla",
        "url": "https://gizmodo.com/elon-musks-doge-seems-to-be-losing-steam-as-he-prepares-to-retreat-to-tesla-2000592185",
        "markdown_title": "[Elon Musk’s DOGE Seems to Be Losing Steam as He Prepares to Retreat to Tesla](https://gizmodo.com/elon-musks-doge-seems-to-be-losing-steam-as-he-prepares-to-retreat-to-tesla-2000592185)",
        "publish_date": "21 Apr 2025",
        "source": "Gizmodo.com",
        "sentiment": -0.566,
        "summary": "Elon Musk is leaving the Department of Government Efficiency (DOGE) after just 130 days as a limited government employee. The DOGE has not achieved its expected savings and policies like the \"5 things\" email have fallen by the wayside. The agency has faced legal challenges and chaos since it was created, with no clear leadership or direction. The DOGE has failed to meet its promises of cutting $2 trillion in federal spending and revising down its cuts to $1 trillion and now $150 billion."
    },
    {
        "title": "5 big takeaways from Tesla's first-quarter earnings call",
        "url": "https://www.businessinsider.com/tesla-earnings-call-five-takeaways-first-quarter-doge-affordability-robotaxis-2025-4",
        "markdown_title": "[5 big takeaways from Tesla's first-quarter earnings call](https://www.businessinsider.com/tesla-earnings-call-five-takeaways-first-quarter-doge-affordability-robotaxis-2025-4)",
        "publish_date": "23 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0.187,
        "summary": "Elon Musk will step back from DOGE to focus on Tesla. Tesla is set to debut its robotaxi service in Austin this June. A more affordable Tesla model is planned for 2020."
    },
    {
        "title": "Thanks, Elon! How X debt sale helped Morgan Stanley's earnings",
        "url": "https://www.businessinsider.com/morgan-stanley-earnings-elon-musk-x-twitter-debt-sale-2025-4",
        "markdown_title": "[Thanks, Elon! How X debt sale helped Morgan Stanley's earnings](https://www.businessinsider.com/morgan-stanley-earnings-elon-musk-x-twitter-debt-sale-2025-4)",
        "publish_date": "11 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0.35,
        "summary": "Morgan Stanley reported a net income of $4.3 billion in the first quarter, up 26% over last year. The bank's equity trading business saw a 45% increase in revenue to a record $4.1 billion in the first quarter. The bank also saw a jump in \"other\" revenue in its institutional securities group, which included the sale of loans raised in 2022 to help Elon Musk buy the social media platform now called X. On Friday, Morgan Stanley CEO Ted Pick said he is \"cautiously optimistic\" about the state of the economy and that market activity since the start of April has been bumpier for some clients."
    },
    {
        "title": "Kids love Cybertrucks. That makes some parents cringe.",
        "url": "https://www.businessinsider.com/tesla-cybertruck-kids-love-elon-musk-2025-4",
        "markdown_title": "[Kids love Cybertrucks. That makes some parents cringe.](https://www.businessinsider.com/tesla-cybertruck-kids-love-elon-musk-2025-4)",
        "publish_date": "11 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0.388,
        "summary": "The Cybertruck is a popular vehicle among children and parents alike. Many kids are drawn to the distinctive appearance of Cybertrucks and their unique features. Elon Musk and his cars have become controversial due to their involvement in DOGE and political opinions. While some adults may be uncomfortable with their children admiring Cybertrucks, they are unaware of the political significance of the vehicles or the issues surrounding Elon Musk and DOGE."
    },
    {
        "title": "Tesla cofounder digs for the new \"black gold\"",
        "url": "https://www.businessinsider.com/tesla-cofounder-digs-for-the-new-black-gold-2025-4",
        "markdown_title": "[Tesla cofounder digs for the new \"black gold\"](https://www.businessinsider.com/tesla-cofounder-digs-for-the-new-black-gold-2025-4)",
        "publish_date": "14 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0.568,
        "summary": "Tesla cofounder digs for the new \"black gold\"\n\nRedwood Materials, run by Tesla cofounder JB Straubel, is building North America's biggest battery recycling operation. Tech editor Alistair Barr visited the Nevada factory in March to see how the company is creating the new \"black gold.\""
    },
    {
        "title": "Elon Musk is stepping back from DOGE to spend more time at Tesla",
        "url": "https://www.businessinsider.com/musk-step-back-doge-teslas-earning-revenue-fall-gerber-ceo-2025-4",
        "markdown_title": "[Elon Musk is stepping back from DOGE to spend more time at Tesla](https://www.businessinsider.com/musk-step-back-doge-teslas-earning-revenue-fall-gerber-ceo-2025-4)",
        "publish_date": "23 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.228,
        "summary": "Elon Musk is stepping back from DOGE to spend more time at Tesla. The president said Tuesday he has no intention of firing Federal Reserve Chair Jerome Powell. What's next for the S&P 500 is uncertain due to elevated uncertainty and heightened volatility in the stock market. Some Wall Street analysts are concerned after new signs suggest Amazon Web Services may be pausing some data center deal."
    },
    {
        "title": "Tesla bull Dan Ives has drastically cut his price target for Tesla, calling it a 'political symbol'",
        "url": "https://www.businessinsider.com/tesla-dan-ives-wedbush-price-target-cut-2025-4",
        "markdown_title": "[Tesla bull Dan Ives has drastically cut his price target for Tesla, calling it a 'political symbol'](https://www.businessinsider.com/tesla-dan-ives-wedbush-price-target-cut-2025-4)",
        "publish_date": "06 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.845,
        "summary": "Dan Ives, a long time bullish analyst for Tesla, has drastically cut his price target for the company from $550 to $315. The reason for the cut is that Tesla has become a political symbol globally and has lost 10% of its future global customer base due to \"self-created brand issues.\" President Donald Trump's new tariffs on Chinese goods are likely to impact Tesla's sales in the key EV market. Early Tesla investor Ross Gerber has also expressed concerns about the company's decline and potential for a \"brutal year ahead\" if Elon Musk does not exit stage left or take a step back on DOGE."
    },
    {
        "title": "Tesla could save itself from a tailspin in sales and shares — by learning from airline disasters",
        "url": "https://www.businessinsider.com/tesla-sales-elon-musk-rebranding-saved-learning-from-airline-disasters-2025-4",
        "markdown_title": "[Tesla could save itself from a tailspin in sales and shares — by learning from airline disasters](https://www.businessinsider.com/tesla-sales-elon-musk-rebranding-saved-learning-from-airline-disasters-2025-4)",
        "publish_date": "06 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.161,
        "summary": "Elon Musk has alienated the eco-conscious customer base who would buy Teslas by his involvement with DOGE and political activities. The company could rebrand by removing Musk, changing its name, and scrapping Cybertrucks to leave its past behind and attract new customers. \"Tesla is more politically skewed than any other brand, and it is clearly skewed liberal,\" David J. Reibstein, Professor of Marketing at The Wharton School, told Business Insider. The company has reported a 13% drop in quarterly sales in the US between January and March compared to the same period in 2024 and lost more than 40% of its sales in Europe between January and February compared to the same two months last year."
    },
    {
        "title": "These companies — or their leaders — donated to Trump's inauguration. Here's how much their share prices have dropped since then.",
        "url": "https://www.businessinsider.com/trump-inauguration-donors-see-company-stock-prices-plunge-since-then-2025-4",
        "markdown_title": "[These companies — or their leaders — donated to Trump's inauguration. Here's how much their share prices have dropped since then.](https://www.businessinsider.com/trump-inauguration-donors-see-company-stock-prices-plunge-since-then-2025-4)",
        "publish_date": "08 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0.216,
        "summary": "Apple donated $1 million to Trump's inauguration and its CEO Tim Cook attended the ceremony. Amazon donated $1 million to Trump's inauguration and its CEO Jeff Bezos praised him for an \"extraordinary political comeback and decisive victory.\" Google donated $1 million to Trump's inauguration fund and its CEO Sundar Pichai also congratulated him on his election win. Meta donated $1 million to Trump's inauguration fund and its CEO Mark Zuckerberg attended the ceremony."
    },
    {
        "title": "3 things Tesla needs to do to make a comeback",
        "url": "https://www.businessinsider.com/tesla-car-sales-how-to-fix-2025-4",
        "markdown_title": "[3 things Tesla needs to do to make a comeback](https://www.businessinsider.com/tesla-car-sales-how-to-fix-2025-4)",
        "publish_date": "03 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.254,
        "summary": "Tesla's Q1 delivery report showed its business is in trouble. The company needs to launch more models. Advanced tech and advertising could be the answer. European and Chinese manufacturers now have EV models that are \"eating into\" Tesla's lead."
    },
    {
        "title": "How much did Elon Musk's DOGE bender put a dent in Cybertruck sales? Here's an answer.",
        "url": "https://www.businessinsider.com/elon-musk-doge-tesla-cybertruck-sales-2025-4",
        "markdown_title": "[How much did Elon Musk's DOGE bender put a dent in Cybertruck sales? Here's an answer.](https://www.businessinsider.com/elon-musk-doge-tesla-cybertruck-sales-2025-4)",
        "publish_date": "10 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.538,
        "summary": "Elon Musk's DOGE bender has hurt Tesla's sales and Cybertruck specifically. Cox Automotive estimates electric vehicle sales and includes a number for Cybertrucks once a quarter. The Cybertruck is either loved or despised and as Musk has waded deeper into DOGE, it has become even more polarizing. Q1 estimates from Cox Automotive show that Tesla sold 6,406 Cybertrucks in the first three months of 2025 compared to 12,991 units in the fourth quarter of 2024 before Elon went full DOGE."
    },
    {
        "title": "Suspected vandalism at Tesla dealerships has spanned at least a dozen states",
        "url": "https://www.businessinsider.com/suspected-tesla-vandalism-spanned-across-a-dozen-states-2025-4",
        "markdown_title": "[Suspected vandalism at Tesla dealerships has spanned at least a dozen states](https://www.businessinsider.com/suspected-tesla-vandalism-spanned-across-a-dozen-states-2025-4)",
        "publish_date": "30 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.743,
        "summary": "Mesa Police in Arizona are investigating arson at a Tesla Service center on Monday morning. The report adds Arizona to a growing list of states that have seen vandalism incidents aimed at the automaker since Musk became involved with DOGE. Oregon Police officers responded to a report of Molotov cocktails being thrown at a dealership in Salem on January 20. Adam Matthew Lansky pleaded not guilty to charges related to throwing Molotov cocktails at a Tesla location in Salem."
    },
    {
        "title": "5 charts that show Elon Musk and Tesla's struggles during Trump's first 100 days",
        "url": "https://www.businessinsider.com/elon-musk-net-worth-tesla-sales-down-trump-100-days-2025-4",
        "markdown_title": "[5 charts that show Elon Musk and Tesla's struggles during Trump's first 100 days](https://www.businessinsider.com/elon-musk-net-worth-tesla-sales-down-trump-100-days-2025-4)",
        "publish_date": "28 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.412,
        "summary": "Elon Musk was viewed as a big winner of President Donald Trump's election, but the first 100 days of the new administration haven't all that smooth for the world's richest person. The stock price of Tesla is down 43% since its mid-December peak and has tumbled since, as the company continues to see a slowdown in vehicle sales globally. Prominent investors have called for Musk to step away from Tesla, even as the CEO pledges to spend less time with the Department of Government Efficiency and more time at the car maker starting in May. Elon Musk's net worth has fallen sharply over the past few months due to the steep decline in Tesla stock and the loss of $150 billion since December 17."
    },
    {
        "title": "Tesla is struggling while BYD sales are storming ahead",
        "url": "https://www.businessinsider.com/tesla-byd-china-ev-sales-elon-musk-2025-4",
        "markdown_title": "[Tesla is struggling while BYD sales are storming ahead](https://www.businessinsider.com/tesla-byd-china-ev-sales-elon-musk-2025-4)",
        "publish_date": "02 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.369,
        "summary": "Tesla is struggling with sales and profits in the electric vehicle market while its Chinese rival BYD is outspending it in the first quarter of 2025. BYD has reported record overseas sales for the third time this year as it expands aggressively in international markets. High tariffs prevent Tesla from selling its cars in the US, but it is gaining market share in China by undercutting BYD on price and overtaking it on innovation. Tesla's stock price has fallen since hitting a high in December due to concerns over Elon Musk's involvement with DOGE."
    },
    {
        "title": "Why Tesla deliveries are much worse than expected",
        "url": "https://www.businessinsider.com/why-tesla-deliveries-are-much-worse-than-expected-2025-4",
        "markdown_title": "[Why Tesla deliveries are much worse than expected](https://www.businessinsider.com/why-tesla-deliveries-are-much-worse-than-expected-2025-4)",
        "publish_date": "02 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.962,
        "summary": "Why Tesla deliveries are much worse than expected\n\nTesla posted first-quarter deliveries of nearly 336,700, which is well below analysts' expectations. So, is it time to worry? Business Insider's Ana Altchek breaks down the report."
    },
    {
        "title": "Trump and Musk's backing wasn't enough to flip Wisconsin Supreme Court",
        "url": "https://www.npr.org/2025/04/01/nx-s1-5345862/wisconsin-supreme-court-crawford-schimel-election-results",
        "markdown_title": "[Trump and Musk's backing wasn't enough to flip Wisconsin Supreme Court](https://www.npr.org/2025/04/01/nx-s1-5345862/wisconsin-supreme-court-crawford-schimel-election-results)",
        "publish_date": "02 Apr 2025",
        "source": "NPR",
        "sentiment": 0,
        "summary": "Susan Crawford has won election to the Wisconsin Supreme Court after defeating Brad Schimel, who received financial support from Elon Musk and an endorsement from President Donald Trump. The race was projected to be the most expensive state supreme court election ever by The Brennan Center for Justice. Spending by the candidates and their supporters reportedly topped $100 million. Turnout was high for a judicial election."
    },
    {
        "title": "These 5 charts show how tight the competition is between Tesla and Chinese rival BYD",
        "url": "https://www.businessinsider.com/5-charts-show-tight-competition-between-tesla-and-chinese-byd-2025-4",
        "markdown_title": "[These 5 charts show how tight the competition is between Tesla and Chinese rival BYD](https://www.businessinsider.com/5-charts-show-tight-competition-between-tesla-and-chinese-byd-2025-4)",
        "publish_date": "01 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0,
        "summary": "These 5 charts show how tight the competition is between Tesla and BYD\n\nAnnual revenue, profit, stock prices and sold EVs show how close the competition is between Tesla and its Chinese rival, BDY."
    },
    {
        "title": "Tesla really wants the Cybertruck to be a working man's truck",
        "url": "https://www.businessinsider.com/tesla-cybertruck-revamp-working-man-f-150-2025-4",
        "markdown_title": "[Tesla really wants the Cybertruck to be a working man's truck](https://www.businessinsider.com/tesla-cybertruck-revamp-working-man-f-150-2025-4)",
        "publish_date": "22 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.291,
        "summary": "Tesla launched the Cybertruck in 2023 and it quickly became a status symbol with Kim Kardashian, Pharrell Williams, and Justin Bieber riding around in it. Less than two years later, the waitlist has disappeared and trucks are piling up in sales lots. Over the past few months, Tesla has moved to position the Cybertruck as a working man's vehicle - less DeLorean, more Ford F-150. The company updated its website, ditching an other-worldly aesthetic for images that feature the truck hauling equipment and an Airstream trailer."
    },
    {
        "title": "Protesters are taking a victory lap after Tesla's dismal earnings — and taking aim at Musk's other companies",
        "url": "https://www.businessinsider.com/tesla-protesters-celebrate-bad-earnings-call-2025-4",
        "markdown_title": "[Protesters are taking a victory lap after Tesla's dismal earnings — and taking aim at Musk's other companies](https://www.businessinsider.com/tesla-protesters-celebrate-bad-earnings-call-2025-4)",
        "publish_date": "25 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.336,
        "summary": "The Tesla Takedown organization is celebrating a win after the automaker's earnings miss on Tuesday. The organization has seen an increase in its follower count on social media following the call. The group plans to expand its efforts to target other companies run by Elon Musk. Climate activists staged a demonstration at a San Francisco dealership accusing Tesla of \"greenwashing\" and calling for Musk's removal as CEO."
    },
    {
        "title": "Why Elon Musk is breaking with Donald Trump over tariffs",
        "url": "https://www.businessinsider.com/elon-musk-donald-trump-tariffs-opposition-tesla-china-byd-2025-4",
        "markdown_title": "[Why Elon Musk is breaking with Donald Trump over tariffs](https://www.businessinsider.com/elon-musk-donald-trump-tariffs-opposition-tesla-china-byd-2025-4)",
        "publish_date": "08 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.515,
        "summary": "Elon Musk has been a vocal supporter of President Trump and his policies, but when it comes to tariffs, he appears to be turning on the president. Musk has made a personal appeal to Trump over the weekend to reverse his tariff plan, without success. On Monday, as global markets fell for a third straight day after the Trump administration doubled down on reciprocal tariffs, Musk posted a video of legendary economist Milton Friedman extolling the virtues of free trade. Musk has been a longtime opponent of tariffs, even when they benefit his businesses."
    },
    {
        "title": "These ex-Tesla employees want to launch a new Roadster before Elon Musk",
        "url": "https://www.businessinsider.com/ex-tesla-employees-want-launch-new-roadster-before-elon-musk-2025-4",
        "markdown_title": "[These ex-Tesla employees want to launch a new Roadster before Elon Musk](https://www.businessinsider.com/ex-tesla-employees-want-launch-new-roadster-before-elon-musk-2025-4)",
        "publish_date": "07 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0,
        "summary": "Daniel Davey and Mark Tapscott are former Tesla employees who founded the EV startup Longbow in 2023. The company plans to launch two electric sports cars: the Speedster ($112,000) and the Roadster ($64,995). The first vehicle will be delivered in 2020 and will be priced at £84,995 ($112,000) and £64,995 respectively. The Roadster is expected to be lighter and cooler than the original Tesla Roadster due to its lightweight construction."
    },
    {
        "title": "The Cybertruck is coming to Saudi Arabia and Dubai. That's still a problem for Tesla.",
        "url": "https://www.businessinsider.com/tesla-cybertruck-saudi-arabia-dubai-launch-small-markets-elon-musk-2025-4",
        "markdown_title": "[The Cybertruck is coming to Saudi Arabia and Dubai. That's still a problem for Tesla.](https://www.businessinsider.com/tesla-cybertruck-saudi-arabia-dubai-launch-small-markets-elon-musk-2025-4)",
        "publish_date": "21 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.497,
        "summary": "Tesla announced this month it would start selling the Cybertruck in Saudi Arabia and Dubai as the first time the divisive electric pickup has been sold outside North America. Deliveries will begin in \"late 2025,\" per Tesla's website. The arrival of the Cybertruck in Saudi Arabia — where EV chargers are scarce and the market for electric cars is tiny — comes amid underwhelming sales of the stainless steel-clad vehicle. Employees previously told Business Insider that some production targets for the truck at the Austin gigafactory had been dropped."
    },
    {
        "title": "The Justice Department has charged a 19-year-old for 'firebombing' Cybertrucks at a Tesla dealership",
        "url": "https://www.businessinsider.com/tesla-cybertruck-attack-charge-pam-bondi-elon-musk-doge-2025-4",
        "markdown_title": "[The Justice Department has charged a 19-year-old for 'firebombing' Cybertrucks at a Tesla dealership](https://www.businessinsider.com/tesla-cybertruck-attack-charge-pam-bondi-elon-musk-doge-2025-4)",
        "publish_date": "19 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.722,
        "summary": "The Justice Department has charged a 19-year-old with \"firebombing\" Cybertrucks at a Tesla dealership in Kansas. Owen McIntire made his first court appearance on Friday and was charged with unlawful possession of an unregistered destructive device and malicious damage by fire. Protesters angry with Tesla CEO Elon Musk's work with the White House DOGE Office to reduce government spending and cut staff have attacked several Tesla facilities across the United States in recent weeks. Data from Cox Automotive shows that used Tesla listings reached a record high in March and coordinated protests targeting Tesla took place across the country late last month."
    },
    {
        "title": "Here's what we do and don't know about Tesla's planned robotaxi launch in June",
        "url": "https://www.businessinsider.com/tesla-cybercab-robotaxi-launch-austin-what-we-know-2025-4",
        "markdown_title": "[Here's what we do and don't know about Tesla's planned robotaxi launch in June](https://www.businessinsider.com/tesla-cybercab-robotaxi-launch-austin-what-we-know-2025-4)",
        "publish_date": "23 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0,
        "summary": "Tesla plans to launch a \"pilot\" robotaxi service in Austin in June. The first set of robotaxis will be Model Ys through a software update. It's unclear whether the first batch of robotaxis will be managed directly by Tesla or if it will consist of privately owned Teslas through which owners will opt in to the service. Musk described Tesla's self-driving capabilities as a \"generalized solution using artificial intelligence.\""
    },
    {
        "title": "I visited the site of Tesla's LA diner before it opened. The building is already changing Hollywood's horizon.",
        "url": "https://www.businessinsider.com/photos-tesla-diner-before-opens-reshaping-hollywood-skyline-2025-4",
        "markdown_title": "[I visited the site of Tesla's LA diner before it opened. The building is already changing Hollywood's horizon.](https://www.businessinsider.com/photos-tesla-diner-before-opens-reshaping-hollywood-skyline-2025-4)",
        "publish_date": "20 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0.224,
        "summary": "The Tesla Diner & Drive-In is a futuristic diner that will serve food and charge electric vehicles in Hollywood. The construction site takes up an entire street corner on Santa Monica Boulevard near two busy intersections in Hollywood. The diner is located near the 101 Freeway and has two 45-foot LED movie screens and dozens of V4 Supercharger stalls. The construction site was quiet during the author's visit but there were four construction workers milling about behind the chain-link fence."
    },
    {
        "title": "Elon Musk says he's refocusing on Tesla. Satellite images show Musk's growing business empire in Texas.",
        "url": "https://www.businessinsider.com/satellite-photos-show-elon-musk-growing-texas-empire-spacex-tesla-2025-4",
        "markdown_title": "[Elon Musk says he's refocusing on Tesla. Satellite images show Musk's growing business empire in Texas.](https://www.businessinsider.com/satellite-photos-show-elon-musk-growing-texas-empire-spacex-tesla-2025-4)",
        "publish_date": "23 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.494,
        "summary": "Elon Musk announced he plans to step back from the DOGE office in May to focus more time on Tesla. Satellite images show his growing business empire in Texas. In 2020, The Boring Company moved its headquarters from California to Texas, followed by Tesla in 2021 and X and SpaceX in 2024. His smaller companies, Neuralink and X.AI also have ties to Texas."
    },
    {
        "title": "The rise of the Tesla Takedown: How anger at Elon Musk boiled over into a global protest movement",
        "url": "https://www.businessinsider.com/tesla-takedown-protests-origin-story-history-elon-musk-2025-4",
        "markdown_title": "[The rise of the Tesla Takedown: How anger at Elon Musk boiled over into a global protest movement](https://www.businessinsider.com/tesla-takedown-protests-origin-story-history-elon-musk-2025-4)",
        "publish_date": "09 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.177,
        "summary": "The anti-Tesla movement started with a Bluesky post and an 80s actor. Alex Winter messaged Joan Donovan on Bluesky and asked her if creating a website to centralize the protest effort would be a good idea. Two weeks after the website launched, more than 1,000 people turned out for a Tesla protest in Los Angeles. By the end of March, protests in more than 250 US cities and in 13 countries had thrust the anger with Musk into the zeitgeist."
    },
    {
        "title": "Tesla sales slump in California even as car buying surges ahead of tariffs",
        "url": "https://www.businessinsider.com/tesla-sales-california-pre-tariff-data-2025-4",
        "markdown_title": "[Tesla sales slump in California even as car buying surges ahead of tariffs](https://www.businessinsider.com/tesla-sales-california-pre-tariff-data-2025-4)",
        "publish_date": "16 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.809,
        "summary": "Tesla's sales in California have been declining for the sixth straight quarter, even as overall new car registrations in the state saw a boost ahead of anticipated tariffs. The decline is attributed to the company's aging lineup and outpacing by competitors. Elon Musk's relationship with California has soured in recent years, with Democratic leaders clashing with him publicly and voters lean blue. In March, Tesla vehicles made up 1.4% of all trade-ins in California, up from just 0.4% a year earlier."
    },
    {
        "title": "4 Tesla owners share what it's like owning the EV among Musk backlash and protests",
        "url": "https://www.businessinsider.com/tesla-owners-fears-elon-musk-backlash-2025-4",
        "markdown_title": "[4 Tesla owners share what it's like owning the EV among Musk backlash and protests](https://www.businessinsider.com/tesla-owners-fears-elon-musk-backlash-2025-4)",
        "publish_date": "18 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0.178,
        "summary": "Ben Baker sold his Cybertruck because of concerns about bullying from anti-Tesla protestors. Another owner told Business Insider they sold company shares but kept the car. Three other owners said they don't plan to get rid of their vehicles, despite the rise in anti-Tesla sentiment. One owner returned his Cybertruck because his daughter was worried about getting bullied."
    },
    {
        "title": "DOGE's deepest cuts to federal jobs are still to come — with or without Elon Musk",
        "url": "https://www.businessinsider.com/elon-musk-leaving-doge-firings-rifs-trump-federal-workforce-cuts-2025-4",
        "markdown_title": "[DOGE's deepest cuts to federal jobs are still to come — with or without Elon Musk](https://www.businessinsider.com/elon-musk-leaving-doge-firings-rifs-trump-federal-workforce-cuts-2025-4)",
        "publish_date": "27 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0,
        "summary": "Elon Musk is leaving the DOGE office to focus on Tesla in May. The first era of DOGE firings continues to face legal challenges, but the next set could be on stronger footing due to the offer of buyout-like deferred resignation plans for workers to voluntarily quit in exchange for months of paid administrative leave. Federal worker unions have vowed to fight back against the new round of reductions and are expecting more intense opposition from their members. The DOGE ethos is alive and well in the federal government, with or without Musk, and the next round of firings could be more targeted and less susceptible to litigation."
    },
    {
        "title": "Federal workers aren't sure if Elon Musk is done with DOGE — but they hope they're done with '5 bullets' emails",
        "url": "https://www.businessinsider.com/fed-workers-react-musk-retreat-doge-focus-on-tesla-2025-4",
        "markdown_title": "[Federal workers aren't sure if Elon Musk is done with DOGE — but they hope they're done with '5 bullets' emails](https://www.businessinsider.com/fed-workers-react-musk-retreat-doge-focus-on-tesla-2025-4)",
        "publish_date": "24 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.677,
        "summary": "Federal workers are ready to trash those \"5 bullets\" emails after Musk said he's exiting DOGE. Many say they're skeptical that Musk will forfeit his White House influence. Some say Musk's legacy will live on in DOGE through cuts to the federal workforce and government budget. Some express concern over reports that DOGE and Musk have access to sensitive information like internal government databases and Americans' Social Security details."
    },
    {
        "title": "Why Tesla needs a different kind of CEO",
        "url": "https://www.businessinsider.com/why-tesla-needs-tim-cook-musk-bored-ceo-apple-jobs-2025-4",
        "markdown_title": "[Why Tesla needs a different kind of CEO](https://www.businessinsider.com/why-tesla-needs-tim-cook-musk-bored-ceo-apple-jobs-2025-4)",
        "publish_date": "30 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0,
        "summary": "Tesla may need a new CEO who can focus on refining and scaling its electric vehicle production, as Elon Musk has shown more interest in inventing new things. This potential change has led some to compare it to Apple's transition from Steve Jobs to Tim Cook, who perfected the smartphone over and over again. A supply chain expert like Cook could help Tesla reach new heights by fine-tuning its manufacturing and sales processes. However, it remains to be seen whether Musk would be willing to relinquish control of the company he founded."
    },
    {
        "title": "Sam Altman's lawyers roast Elon Musk in scorching new court filing",
        "url": "https://www.businessinsider.com/sam-altman-lawyers-roasted-elon-musk-new-lawsuit-filing-2025-4",
        "markdown_title": "[Sam Altman's lawyers roast Elon Musk in scorching new court filing](https://www.businessinsider.com/sam-altman-lawyers-roasted-elon-musk-new-lawsuit-filing-2025-4)",
        "publish_date": "10 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.741,
        "summary": "Elon Musk is being accused of trying to harm OpenAI through various tactics such as press attacks, malicious campaigns on social media, and a pretextual demand for corporate records. Sam Altman's lawyers have filed a court filing that accuses Musk of trying to take down OpenAI and build a competitor for his personal benefit. OpenAI has counter-sued Musk in a series of X posts published on Wednesday. The judge has set a March 2026 trial date in the lawsuit between the two tech titans."
    },
    {
        "title": "VW has overtaken Tesla as Europe's top EV seller",
        "url": "https://www.businessinsider.com/volkswagen-overtakes-tesla-europe-top-ev-seller-elon-musk-2025-4",
        "markdown_title": "[VW has overtaken Tesla as Europe's top EV seller](https://www.businessinsider.com/volkswagen-overtakes-tesla-europe-top-ev-seller-elon-musk-2025-4)",
        "publish_date": "24 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.702,
        "summary": "Volkswagen has overtaken Tesla as the top EV seller in Europe for the first three months of the year. VW's EV registrations more than doubled year-over-year to 65,679 in the first quarter, while Tesla saw its registrations drop 38% to 53,237. Battery EVs accounted for 16.9% of total car registrations in March compared to 16.9% in 2024. Despite the decline, Tesla's Model Y and Model 3 remain the top two most-registered battery EVs in Europe."
    },
    {
        "title": "A lawsuit accuses Tesla of juicing odometers. So do these drivers.",
        "url": "https://www.businessinsider.com/tesla-lawsuit-odometer-fraud-inaccurate-mileage-warranty-void-2025-4",
        "markdown_title": "[A lawsuit accuses Tesla of juicing odometers. So do these drivers.](https://www.businessinsider.com/tesla-lawsuit-odometer-fraud-inaccurate-mileage-warranty-void-2025-4)",
        "publish_date": "24 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.634,
        "summary": "A lawsuit accuses Tesla of manipulating mileage on its electric vehicles to more quickly void its warranties. Other Tesla drivers have reported seeing significant differences between how much they say they drive and what shows up on the odometer. The class action suit filed by Nyree Hinton alleges that Tesla uses algorithms and energy consumption metrics to manipulate and misrepresent the actual mileage traveled by Tesla vehicles. It's unclear how many Tesla drivers have noticed similar gaps or whether it constitutes a pattern."
    },
    {
        "title": "Ex-Waymo CEO shoots back after Elon Musk's Tesla earnings diss",
        "url": "https://www.businessinsider.com/elon-musk-waymo-diss-john-krafcik-robotaxi-wars-cybercab-2025-4",
        "markdown_title": "[Ex-Waymo CEO shoots back after Elon Musk's Tesla earnings diss](https://www.businessinsider.com/elon-musk-waymo-diss-john-krafcik-robotaxi-wars-cybercab-2025-4)",
        "publish_date": "25 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0,
        "summary": "Elon Musk said that Waymo robotaxis cost more money to build during his Tesla earnings call. Ex-Waymo CEO John Krafcik responded by saying that Tesla has never competed with Waymo in the market for fully autonomous vehicles and has failed at it for 10 years. Musk also announced that Tesla will start a \"pilot\" rollout of its robotaxi service in Austin in June using 10 to 20 Model Y cars. Musk also predicted that Tesla will have millions of fully autonomous Teslas on the road by the second half of next year and a market share domination of \"99% or something ridiculous.\""
    },
    {
        "title": "Insiders reveal how Tesla is preparing for its June robotaxi launch",
        "url": "https://www.businessinsider.com/tesla-robotaxi-launch-austin-june-internal-details-2025-4",
        "markdown_title": "[Insiders reveal how Tesla is preparing for its June robotaxi launch](https://www.businessinsider.com/tesla-robotaxi-launch-austin-june-internal-details-2025-4)",
        "publish_date": "25 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0.225,
        "summary": "Tesla has set a June 1 deadline for its robotaxi launch in Austin, Texas. The company has about 300 test operators and has worked to build up \"critical miles.\" It also rolled out a test version of its robotaxi app to Autopilot engineers and held an event with local first responders. The former employee described the June 1 deadline as more \"aspirational\" or \"motivational.\""
    },
    {
        "title": "Tesla wants to bring the Cybertruck down to earth",
        "url": "https://www.businessinsider.com/tesla-earnings-cybertruck-working-mans-truck-elon-musk-futuristic-2025-4",
        "markdown_title": "[Tesla wants to bring the Cybertruck down to earth](https://www.businessinsider.com/tesla-earnings-cybertruck-working-mans-truck-elon-musk-futuristic-2025-4)",
        "publish_date": "22 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.254,
        "summary": "Tesla is preparing to deliver first-quarter earnings on Tuesday and Wall Street will be watching for insight into the impact of the Cybertruck backlash on Tesla's revenue and profit, as well as the potential end date for CEO Elon Musk's DOGE work. The \"sell America\" trade is in full swing following Trump's tweet about tariffs on American goods. Tesla's chief financial officer said on the company's last earnings call that if implemented, tariffs would affect the automaker's business and profitability. Business Insider Today is reporting on a new research paper co-authored by Google's David Silver that announces a radical new era for AI and also reads as a \"dis\" of OpenAI."
    },
    {
        "title": "Ex-Tesla engineers launch luxury electric sports car startup: 'Making every effort to make cars available ... as quickly as possible'",
        "url": "https://autos.yahoo.com/ex-tesla-engineers-launch-luxury-104552165.html",
        "markdown_title": "[Ex-Tesla engineers launch luxury electric sports car startup: 'Making every effort to make cars available ... as quickly as possible'](https://autos.yahoo.com/ex-tesla-engineers-launch-luxury-104552165.html)",
        "publish_date": "13 Apr 2025",
        "source": "Yahoo Entertainment",
        "sentiment": 0.246,
        "summary": "Longbow is a U.K.-based startup that will release \"featherweight\" electric sports cars next year. The company was founded by Jenny Keisu, Daniel Davey, and Mark Tapscott, two of whom are Tesla alumni. They have developed two models, the Speedster and the Roadster, which are set to be released next year. So far, only U.K. customers can make reservations for the Speedster and Roadster."
    },
    {
        "title": "Fact-check: Who's right in the Musk-Navarro feud over Tesla?",
        "url": "https://www.npr.org/2025/04/08/nx-s1-5356183/tesla-musk-navarro-fact-check",
        "markdown_title": "[Fact-check: Who's right in the Musk-Navarro feud over Tesla?](https://www.npr.org/2025/04/08/nx-s1-5356183/tesla-musk-navarro-fact-check)",
        "publish_date": "08 Apr 2025",
        "source": "NPR",
        "sentiment": -0.335,
        "summary": "Peter Navarro and Elon Musk are feuding over the production of Tesla cars. Musk is a car manufacturer and opposes tariffs on foreign parts. The original Tesla Roadster was assembled rather than manufactured. Analysts at Bernstein project a less than 5% impact to Tesla's gross profit margins from tariffs on car parts."
    },
    {
        "title": "Elon Musk's bad day: A huge loss in Wisconsin and awful Tesla numbers",
        "url": "https://www.businessinsider.com/elon-musk-future-wisconsin-supreme-court-tesla-deliveries-numbers-2025-4",
        "markdown_title": "[Elon Musk's bad day: A huge loss in Wisconsin and awful Tesla numbers](https://www.businessinsider.com/elon-musk-future-wisconsin-supreme-court-tesla-deliveries-numbers-2025-4)",
        "publish_date": "02 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.831,
        "summary": "Elon Musk spent at least $20 million on a failed Wisconsin candidate. Tesla reported poor sales numbers in the first quarter of this year. A report from Politico said that President Trump's inner circle was preparing for Musk to step back from his role at DOGE. The White House later disputed Politico's report and stated that Musk will depart from public service as a special government employee when his work at DOGE is complete."
    },
    {
        "title": "In the Nevada desert, a Tesla cofounder digs deep for the new black gold",
        "url": "https://www.businessinsider.com/redwood-materials-jb-straubel-evs-batteries-new-black-gold-tesla-2025-4",
        "markdown_title": "[In the Nevada desert, a Tesla cofounder digs deep for the new black gold](https://www.businessinsider.com/redwood-materials-jb-straubel-evs-batteries-new-black-gold-tesla-2025-4)",
        "publish_date": "10 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0.357,
        "summary": "Redwood Materials, a Tesla co-founder and investor, is building North America's biggest battery recycling operation in the Nevada desert. The company currently recycles more than 70% of all lithium-ion batteries in North America and is working on combining the base ingredients of old batteries to create new black gold known as Cathode Active Material (CAM). The process involves heating old batteries to extract valuable base metals and then combining them into CAM. The company has raised $2 billion from investors and is expected to be able to execute on its ambitious project by partnering with experienced executives and having the trust of governments."
    },
    {
        "title": "These 6 Chinese EVs are giving Tesla a headache in Europe",
        "url": "https://www.businessinsider.com/6-chinese-evs-giving-tesla-a-headache-in-europe-2025-4",
        "markdown_title": "[These 6 Chinese EVs are giving Tesla a headache in Europe](https://www.businessinsider.com/6-chinese-evs-giving-tesla-a-headache-in-europe-2025-4)",
        "publish_date": "22 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0,
        "summary": "Tesla's sales have dropped by 37% in Europe in the first three months of the year as it struggles with a global brand crisis and new competitors. Chinese automakers like BYD are expanding rapidly overseas, particularly in Europe. The Seal U hybrid SUV sold by BYD has sold around 12,400 units this year with over half of those sales coming in the past month. The all-electric Dolphin made its European debut in 2023 and has sold 4,500 units so far in 2025 with a 175% increase from the same period last year."
    },
    {
        "title": "Tesla adds over a thousand workers to jumpstart Semi truck production",
        "url": "https://www.businessinsider.com/tesla-ramps-up-hiring-for-semi-truck-2025-4",
        "markdown_title": "[Tesla adds over a thousand workers to jumpstart Semi truck production](https://www.businessinsider.com/tesla-ramps-up-hiring-for-semi-truck-2025-4)",
        "publish_date": "29 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0.336,
        "summary": "Tesla is hiring more than 1,000 new factory workers in Nevada to accelerate its Semi truck production. The increase in hiring coincides with the company opening an extension at the Nevada Gigafactory purely for Semi production. On its website, Tesla lists more than 80 manufacturing roles for the development of the Semi, from test and service technician roles to engineering and quality assurance positions. Elon Musk first unveiled the Tesla Semi in 2017 and estimated that the truck would go into mass production in 2019."
    },
    {
        "title": "This $235,000 Porsche hybrid is the super sedan I'd buy over a Tesla or Lucid",
        "url": "https://www.businessinsider.com/porsche-panamera-turbo-e-hybrid-review-ev-range-tech-v8-2025-4",
        "markdown_title": "[This $235,000 Porsche hybrid is the super sedan I'd buy over a Tesla or Lucid](https://www.businessinsider.com/porsche-panamera-turbo-e-hybrid-review-ev-range-tech-v8-2025-4)",
        "publish_date": "08 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0.981,
        "summary": "The Porsche Panamera Turbo E-Hybrid is a high-performance plug-in hybrid super sedan with an impressive hybrid V8 powertrain and incredible driving experience. Unfortunately, supercar performance comes with supercar prices and the base model starts at $195,700 while the range-topping Turbo S E-Hybrid requires $226,500. The design of the Panamera has been refined to feel sleeker and more elegant without compromising headroom. Upfront, the biggest change was the new LED Matrix headlights which automatically adjust illumination based on navigation data, vehicle speed, and the front-facing camera to avoid blinding oncoming drivers."
    },
    {
        "title": "Tesla drops Cybertruck production targets and moves some workers off the line, employees say",
        "url": "https://www.businessinsider.com/tesla-cybertruck-production-drops-sales-slump-2025-4",
        "markdown_title": "[Tesla drops Cybertruck production targets and moves some workers off the line, employees say](https://www.businessinsider.com/tesla-cybertruck-production-drops-sales-slump-2025-4)",
        "publish_date": "17 Apr 2025",
        "source": "Business Insider",
        "sentiment": -0.215,
        "summary": "Tesla is reducing Cybertruck production and reallocating some staff to Model Y lines, workers say. The company has dropped production targets for several Cybertruck lines over the past few months, two workers with knowledge of the targets told Business Insider. Since January, the carmaker has continued to move some workers from the line for the Cybertruck, which is made at its Texas Gigafactory, to the Model Y line, four workers said. Tesla sales more broadly have been trending downward."
    },
    {
        "title": "Tesla used vehicle prices are tumbling, another worrying sign for the EV maker",
        "url": "https://finance.yahoo.com/news/tesla-used-vehicle-prices-are-tumbling-another-worrying-sign-for-the-ev-maker-161433870.html",
        "markdown_title": "[Tesla used vehicle prices are tumbling, another worrying sign for the EV maker](https://finance.yahoo.com/news/tesla-used-vehicle-prices-are-tumbling-another-worrying-sign-for-the-ev-maker-161433870.html)",
        "publish_date": "22 Apr 2025",
        "source": "Yahoo Entertainment",
        "sentiment": -0.822,
        "summary": "Tesla used car prices dropped 10.1% in March year over year, the biggest drop among the 10 auto brands that saw falling values in 1- to 5-year-old cars per new report from auto research site iSeeCars. Four Teslas featured prominently on the list of top 20 models with the largest price drops, with the Model S sedan having the biggest year-over-year price drop at 17.2% or nearly $10,000 from a year ago. Price cuts over the years for new Tesla EVs have weighed heavily on the used car market, as buyers were getting better value by buying new. And while that boosted new car sales, it crushed existing Tesla owners who were getting far less at trade-in and put the hurt on fleet operators like rental car chains."
    },
    {
        "title": "Tesla Is No Longer the Only Benchmark for EV Success",
        "url": "https://time.com/7280460/tesla-no-longer-only-benchmark-ev-success/",
        "markdown_title": "[Tesla Is No Longer the Only Benchmark for EV Success](https://time.com/7280460/tesla-no-longer-only-benchmark-ev-success/)",
        "publish_date": "25 Apr 2025",
        "source": "Time",
        "sentiment": 0,
        "summary": "Tesla's sales have declined in the first quarter of 2025 from the previous year. The company reported a 71% decline in net income for the same period. Share prices have declined more than 40% since its peak last December. The success of EVs is no longer tethered to Tesla's success."
    },
    {
        "title": "BYD is piling on the pain for Tesla. These 5 charts break down how the rivals square up.",
        "url": "https://www.businessinsider.com/tesla-byd-charts-ev-rivals-elon-musk-china-2025-3",
        "markdown_title": "[BYD is piling on the pain for Tesla. These 5 charts break down how the rivals square up.](https://www.businessinsider.com/tesla-byd-charts-ev-rivals-elon-musk-china-2025-3)",
        "publish_date": "01 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0,
        "summary": "Tesla and BYD are neck-and-neck on electric vehicle sales. BYD's revenue surpassed Tesla's in 2024. Tesla outstrips BYD when it comes to profits. Both Tesla and BYD make about 80% of their revenue from cars."
    },
    {
        "title": "Uber CEO Dara Khosrowshahi says self-driving on his Tesla is 'delightful' and welcomes Elon Musk's competition in autonomous taxis",
        "url": "https://www.businessinsider.com/uber-dara-khosrowshahi-tesla-robotaxis-elon-musk-2025-4",
        "markdown_title": "[Uber CEO Dara Khosrowshahi says self-driving on his Tesla is 'delightful' and welcomes Elon Musk's competition in autonomous taxis](https://www.businessinsider.com/uber-dara-khosrowshahi-tesla-robotaxis-elon-musk-2025-4)",
        "publish_date": "25 Apr 2025",
        "source": "Business Insider",
        "sentiment": 0.61,
        "summary": "Uber CEO Dara Khosrowshahi said on Friday that he isn't sweating Elon Musk's robotaxis. He owns a Tesla and has tried full self-driving. Khosrowshahi said Uber would \"love to work with\" Musk's company. He also revealed that he owns a Tesla and has tried full self-driving."
    },
    {
        "title": "Tesla Stock Price Reaches ‘Death Cross’ Status",
        "url": "https://gizmodo.com/tesla-stock-price-reaches-death-cross-status-2000589799",
        "markdown_title": "[Tesla Stock Price Reaches ‘Death Cross’ Status](https://gizmodo.com/tesla-stock-price-reaches-death-cross-status-2000589799)",
        "publish_date": "15 Apr 2025",
        "source": "Gizmodo.com",
        "sentiment": -0.405,
        "summary": "Tesla's stock price has reached \"death cross\" status, which is an indicator of a likely downturn for the company. The \"death cross\" has been hitting major players like Tesla and other companies due to tariff trouble. The \"death cross\" is not a reliable indicator and it can mark the worst points for the index rather than a harbinger of a steeper decline. Analysts do not consider death crosses as reliable indicators and they are more often used as a harbinger of a steep decline rather than a harbinger of a steep decline."
    },
    {
        "title": "As Elon Tries to Avoid the Spotlight, Climate Activists Brazenly Vandalize Tesla Dealership",
        "url": "https://gizmodo.com/as-elon-tries-to-avoid-the-spotlight-climate-activists-brazenly-vandalize-tesla-dealership-2000592930",
        "markdown_title": "[As Elon Tries to Avoid the Spotlight, Climate Activists Brazenly Vandalize Tesla Dealership](https://gizmodo.com/as-elon-tries-to-avoid-the-spotlight-climate-activists-brazenly-vandalize-tesla-dealership-2000592930)",
        "publish_date": "22 Apr 2025",
        "source": "Gizmodo.com",
        "sentiment": -0.516,
        "summary": "Elon Musk is the CEO of Tesla and serves as an absentee CEO while he works on his company's future. The company has been facing negative publicity related to its relationship with the Trump administration and Elon Musk's involvement in government. Environmental activists have vandalized a Tesla dealership in Manhattan on Earth Day with anti-Musk messages. The incident comes at a time when Tesla is expected to report its first quarter earnings for 2025, which could be a crucial moment for the company."
    },
    {
        "title": "Tesla Bull Ross Gerber Says Elon Musk 'Doesn't Care' About Company Anymore, Blames Focus On Other Ventures For EV Maker's Slump",
        "url": "https://finance.yahoo.com/news/tesla-bull-ross-gerber-says-183111512.html",
        "markdown_title": "[Tesla Bull Ross Gerber Says Elon Musk 'Doesn't Care' About Company Anymore, Blames Focus On Other Ventures For EV Maker's Slump](https://finance.yahoo.com/news/tesla-bull-ross-gerber-says-183111512.html)",
        "publish_date": "17 Apr 2025",
        "source": "Yahoo Entertainment",
        "sentiment": -0.433,
        "summary": "Ross Gerber, CEO of Gerber Kawasaki Wealth & Investment Management, has publicly criticized Tesla CEO Elon Musk for his lack of care for the company. Gerber has faced backlash from retail investors who have expressed frustration with his comments. Gerber maintains holdings in Tesla for clients despite his criticisms. The article discusses the impact of Musk's outside activities and reduced involvement with the company on Tesla's stock performance."
    },
    {
        "title": "India Bars BYD Entry as Minister Signals Preference for Tesla, Citing Trade Concerns",
        "url": "https://finance.yahoo.com/news/india-bars-byd-entry-minister-151057141.html",
        "markdown_title": "[India Bars BYD Entry as Minister Signals Preference for Tesla, Citing Trade Concerns](https://finance.yahoo.com/news/india-bars-byd-entry-minister-151057141.html)",
        "publish_date": "08 Apr 2025",
        "source": "Yahoo Entertainment",
        "sentiment": -0.455,
        "summary": "India is not ready to allow Chinese electric vehicle maker BYD Company (BYDDY, Financials) to enter its market, Commerce Minister Piyush Goyal said during the India Global Forum on April 7. The government remains unconvinced that BYD will comply with India's rules. India must be cautious about which international firms it lets in. The minister traced today's global economic challenges to China's entry into the World Trade Organization more than two decades ago."
    },
    {
        "title": "Tesla must do these 3 on its earnings call, or else",
        "url": "https://finance.yahoo.com/video/tesla-must-3-earnings-call-140131072.html",
        "markdown_title": "[Tesla must do these 3 on its earnings call, or else](https://finance.yahoo.com/video/tesla-must-3-earnings-call-140131072.html)",
        "publish_date": "21 Apr 2025",
        "source": "Yahoo Entertainment",
        "sentiment": 0.21,
        "summary": "Elon Musk must tell investors when he plans to exit his DOGE role and get back to 100% focus on Tesla. Tariff impact: Musk (or other execs on the earnings call) must clearly quantify the financial impact of Trump's tariffs on Tesla's business. Turning Tesla around: Musk must articulate the turnaround plan for Tesla. The company may not be bloated cost-wise like typical turnarounds, but Musk has a lot to fix to get the top line back on track."
    },
    {
        "title": "I wouldn't get into a Tesla Robotaxi",
        "url": "https://substack.com/@theahura/note/c-112383923",
        "markdown_title": "[I wouldn't get into a Tesla Robotaxi](https://substack.com/@theahura/note/c-112383923)",
        "publish_date": "27 Apr 2025",
        "source": "Substack.com",
        "sentiment": -0.385,
        "summary": "Elon claims that Tesla FSD can do 10 thousand miles without needing intervention roughly once every year. The average Tesla owner reports needing to intervene every 500 miles driven, or roughly once every 2 weeks. Even if we buy what Elon is saying, that means every one of his robotaxis is going to get into an accident of some kind at least once a year! Human drivers have small accidents every 100000 miles."
    },
    {
        "title": "Elon Musk makes controversial decision that could cost Tesla big time",
        "url": "https://www.thestreet.com/technology/elon-musk-makes-controversial-decision-that-could-cost-tesla-big-time",
        "markdown_title": "[Elon Musk makes controversial decision that could cost Tesla big time](https://www.thestreet.com/technology/elon-musk-makes-controversial-decision-that-could-cost-tesla-big-time)",
        "publish_date": "18 Apr 2025",
        "source": "TheStreet",
        "sentiment": -0.462,
        "summary": "Elon Musk has been a controversial figure in the electric vehicle (EV) industry, known for his unconventional leadership choices and lack of regard for ethical business practices. The Tesla CEO has faced accusations from major tech rivals over his decision to prioritize self-driving technology over more affordable daily driver EVs and ignore internal warnings about the potential impact on the company. A new report suggests that Musk's decision to focus on the Cybercab at the expense of the $25,000 Tesla Model 2 may have been ill-advised and could cost Tesla big time. Internal analysts at Tesla warned Musk that the robotaxi \"might never be profitable,\" and could negatively impact the company in the long run."
    },
    {
        "title": "DOJ Charges New Mexico Man With Arson Against Tesla Showroom and Republican HQ",
        "url": "https://gizmodo.com/doj-charges-new-mexico-man-with-arson-against-tesla-showroom-and-republican-hq-2000589339",
        "markdown_title": "[DOJ Charges New Mexico Man With Arson Against Tesla Showroom and Republican HQ](https://gizmodo.com/doj-charges-new-mexico-man-with-arson-against-tesla-showroom-and-republican-hq-2000589339)",
        "publish_date": "15 Apr 2025",
        "source": "Gizmodo.com",
        "sentiment": -0.536,
        "summary": "Jamison R. Wagner was arrested on Monday and charged with arson for allegedly setting fires at a Tesla showroom in Albuquerque and the local Republican Party headquarters. The DOJ alleges that Wagner damaged two Tesla vehicles at the Tesla Showroom in Albuquerque during the early morning hours of Feb 9, 2025, one of which appears to have significant damage and another simply has a window smashed. An \"intact glass container\" was found in the second vehicle \"containing an improvised napalm material.\" The building of the Tesla Showroom and six other vehicles on the property were hit with graffiti reading \"Die Elon,\" \"Tesla Nazi Inc,\" and \"Die Tesla Nazi,\" as well as swastikas."
    },
    {
        "title": "How Tesla Is Replacing the Age-Old Can Bus",
        "url": "https://www.notateslaapp.com/news/2645/how-tesla-is-replacing-the-age-old-can-bus",
        "markdown_title": "[How Tesla Is Replacing the Age-Old Can Bus](https://www.notateslaapp.com/news/2645/how-tesla-is-replacing-the-age-old-can-bus)",
        "publish_date": "21 Apr 2025",
        "source": "Notateslaapp.com",
        "sentiment": 0.348,
        "summary": "Tesla is replacing the CAN Bus with a new network technology that is more efficient and reliable. The previous CAN system is limited to 1Mbps and 8Mbps respectively, which is not sufficient for modern data-driven vehicles. The new network technology uses TDMA (Time Division Multiple Access) to ensure access to each node or data point without interference. The new network operates in repeating cycles and assigns specific time slots to avoid collisions between messages."
    },
    {
        "title": "Tesla celebrates key milestone for 4680 battery cell production cost",
        "url": "https://www.teslarati.com/tesla-milestone-4680-battery-cell/",
        "markdown_title": "[Tesla celebrates key milestone for 4680 battery cell production cost](https://www.teslarati.com/tesla-milestone-4680-battery-cell/)",
        "publish_date": "07 Apr 2025",
        "source": "Teslarati",
        "sentiment": 0.774,
        "summary": "Tesla's Texas manufacturing team has scaled production enough to outpace the cost-effectiveness of outside suppliers for 4680 battery cells. The company's in-house 4680 battery cells have become the lowest cost per kWh battery cell producer for Tesla. Musk pointed out during the meeting that the achievement is particularly impressive given that many of the company's suppliers dedicate all or most of their businesses to battery cell manufacturing, while Tesla focuses on several other business sectors and still managed to surpass the milestone. 2025 will have more big milestones with fully ramped dry battery electrode manufacturing to deliver even more cost efficiency."
    },
    {
        "title": "The Guerrilla Marketing Campaign Against Elon Musk",
        "url": "https://www.newyorker.com/news/the-lede/the-guerrilla-marketing-campaign-against-elon-musk",
        "markdown_title": "[The Guerrilla Marketing Campaign Against Elon Musk](https://www.newyorker.com/news/the-lede/the-guerrilla-marketing-campaign-against-elon-musk)",
        "publish_date": "24 Apr 2025",
        "source": "The New Yorker",
        "sentiment": 0,
        "summary": "Elon Musk is a bellend in the UK. The posters on London's public transport network are not authorized by TfL nor their advertising partners. On Tuesday, after Tesla reported a profit drop of 71%, Musk announced that he would be spending less time working with the Trump Administration. Outside of his work at the Department of Government Efficiency, Musk has devoted a surprising amount of time to trolling the country."
    }
]